In [1]:
import pandas as pd
import os
from pprint import pprint
import requests
import json
from config import api_key
import sys

In [2]:
#Made edits in excel, pulling back in
city_map= pd.read_csv("city_map.csv")
city_map = city_map.drop(columns=['Unnamed: 0'])
city_map = city_map.rename(columns={'0':'city_map_old'})
city_map

         city_map_old
0               Cairo
1       Donalsonville
2         Johns Creek
3             Blakely
4          Bainbridge
5            Colquitt
6           St. Marys
7            Cuthbert
8            LaGrange
9   Peachtree Corners
10         East Point

In [7]:
#Made edits in excel, pulling back in
census_cities= pd.read_csv("census_cities.csv")
census_cities = census_cities.drop(columns=['Unnamed: 0'])
census_cities = census_cities.rename(columns={'0':'census_cities_old'})
census_cities

    census_cities_old
0             Atlanta
1        Saint George
2              Shiloh
3            Valdosta
4       Cedar Springs
..                ...
625            Berlin
626  Franklin Springs
627            Helena
628        Rocky Ford
629         Hillsboro

[630 rows x 1 columns]

In [4]:
city_map['city_map_new'] = ''
city_map.loc[0,'city_map_new'] = 'Cairo'
city_map.loc[1,'city_map_new'] = 'Donalsonville'
city_map.loc[2,'city_map_new'] = 'Alpharetta'
city_map.loc[3,'city_map_new'] = 'Blakely'
city_map.loc[4,'city_map_new'] = 'Bainbridge'
city_map.loc[5,'city_map_new'] = 'Colquitt'
city_map.loc[6,'city_map_new'] = 'Saint Marys'
city_map.loc[7,'city_map_new'] = 'Cuthbert'
city_map.loc[8,'city_map_new'] = 'Lagrange'
city_map.loc[9,'city_map_new'] = 'Roswell'
city_map.loc[10,'city_map_new'] = 'East Point'

city_map

         city_map_old   city_map_new
0               Cairo          Cairo
1       Donalsonville  Donalsonville
2         Johns Creek     Alpharetta
3             Blakely        Blakely
4          Bainbridge     Bainbridge
5            Colquitt       Colquitt
6           St. Marys    Saint Marys
7            Cuthbert       Cuthbert
8            LaGrange       Lagrange
9   Peachtree Corners        Roswell
10         East Point     East Point

In [8]:
# census_cities = census_cities.loc[(census_cities['census_cities_old'] == 'Donalsonville')]
# census_cities

    census_cities_old
366     Donalsonville

In [10]:
city_map = city_map.to_csv("citi_map_v2.csv")